package tdx

import (
	"net"
	"strings"
	"sync"
	"time"

	"github.com/injoyai/base/safe"
	"github.com/injoyai/conv"
	"github.com/injoyai/logs"
)

var (

	// Hosts 所有服务器地址(2024-11-30测试通过)
	Hosts = func() []string {
		lenSH := len(SHHosts)
		lenBJ := len(BJHosts)
		lenGZ := len(GZHosts)
		lenWH := len(WHHosts)
		lenGTHT := len(GTHTHosts)

		ls := make([]string, lenSH+lenBJ+lenGZ+lenWH+lenGTHT)
		copy(ls[:lenSH], SHHosts)
		copy(ls[lenSH:lenSH+lenBJ], BJHosts)
		copy(ls[lenSH+lenBJ:lenSH+lenBJ+lenGZ], GZHosts)
		copy(ls[lenSH+lenBJ+lenGZ:lenSH+lenBJ+lenGZ+lenWH], WHHosts)
		copy(ls[lenSH+lenBJ+lenGZ+lenWH:lenSH+lenBJ+lenGZ+lenWH+lenGTHT], GTHTHosts)
		return ls
	}()

	// SHHosts 上海服务器地址
	SHHosts = []string{
		"124.71.187.122",  //华为
		"122.51.120.217",  //腾讯
		"111.229.247.189", //腾讯
		"122.51.232.182",  //腾讯
		"118.25.98.114",   //腾讯
		"124.70.199.56",   //华为
		"121.36.225.169",  //华为
		"123.60.70.228",   //华为
		"123.60.73.44",    //华为
		"124.70.133.119",  //华为
		"124.71.187.72",   //华为
		"123.60.84.66",    //华为
		"124.223.163.242", //腾讯云
		"150.158.160.2",   //腾讯云
		"101.35.121.35",   //腾讯云
		"111.231.113.208", //腾讯云
	}

	// BJHosts 北京服务器地址
	BJHosts = []string{
		"62.234.50.143",   //腾讯云
		"81.70.151.186",   //腾讯云
		"101.42.240.54",   //腾讯云
		"101.43.159.194",  //腾讯云
		"120.53.8.251",    //腾讯云
		"152.136.191.169", //腾讯云
		"49.232.15.141",   //腾讯云
		"82.156.174.84",   //腾讯云
		"101.42.164.241",  //腾讯云

	}

	// GZHosts 广州服务器地址,客户端上可能显示深圳
	GZHosts = []string{
		"124.71.9.153",    //华为
		"116.205.163.254", //华为
		"116.205.171.132", //华为
		"116.205.183.150", //华为
		"111.230.186.52",  //腾讯
		"110.41.2.72",     //华为
		"110.41.147.114",  //华为,这个客户端显示深圳线路1,IP查询是广州的
		"101.33.225.16",   //腾讯云
		"175.178.112.197", //腾讯云
		"175.178.128.227", //腾讯云
		"43.139.95.83",    //腾讯云
		"159.75.29.111",   //腾讯云
		"43.139.18.171",   //腾讯云
		"81.71.32.47",     //腾讯云
		"129.204.230.128", //腾讯云
	}

	// WHHosts 武汉服务器地址
	WHHosts = []string{
		"119.97.185.59", //电信
	}

	// 国泰海通 服务器地址 HostNum=66 PrimaryHost=17
	// C:\GTJA\RichEZ\newVer\connect.cfg
	GTHTHosts = []string{
		// 国泰海通深圳电信组站
		"sztdx.gtjas.com",
		// 国泰海通江苏电信组站
		"jstdx.gtjas.com",
		// 国泰海通上海电信组站
		"shtdx.gtjas.com",
		// 国泰海通北京网通组站
		"bjwttdx.gtjas.com",
		// 国泰海通北方网通组站
		"bfwttdx.gtjas.com",
		// 国泰海通河北网通组站
		"hbwttdx.gtjas.com",
		// 国泰海通成都电信组站
		"cdtdx.gtjas.com",
		// 郑州网通行情一
		"182.118.47.141",
		// 郑州网通行情二
		"182.118.47.168",
		// 郑州网通行情三
		"182.118.47.169",
		// 武汉电信行情一
		"119.97.164.184",
		// 武汉电信行情二
		"119.97.164.189",
		// 武汉电信行情三
		"116.211.121.102",
		// 武汉电信行情四
		"116.211.121.108",
		// 新疆电信云行情一
		"202.100.166.117",
		// 上海BGP行情一
		"103.251.85.90",
		// 上海BGP行情二
		"103.251.85.91",
		// 上海BGP行情三
		"103.251.85.92",
		// 上海BGP行情四
		"103.251.85.93",
		// 上海BGP行情八
		"114.28.173.132",
		// 南京电信行情十一
		"103.221.142.80",
		// 北京联通行情一
		"123.125.108.213",
		// 北京联通行情二
		"123.125.108.214",
		// 上海BGP行情五
		"103.251.85.94",
		// 上海BGP行情九
		"114.28.173.134",
		// 成都BGP行情一
		"148.70.110.41",
		// 成都BGP行情二
		"148.70.93.117",
		// 成都BGP行情三
		"148.70.31.16",
		// 成都BGP行情四
		"148.70.111.63",
		// 广州BGP行情一
		"139.159.143.228",
		// 广州BGP行情二
		"139.159.183.76",
		// 广州BGP行情三
		"139.159.193.118",
		// 广州BGP行情四
		"139.159.195.177",
		// 广州BGP行情五
		"139.159.202.253",
		// 深圳行情一
		"109.244.73.82",
		// 深圳行情二
		"109.244.73.84",
		// 广州BGP行情八
		"139.9.43.104",
		// 广州BGP行情九
		"139.9.43.31",
		// 广州BGP行情十
		"139.9.50.246",
		// 广州BGP行情十一
		"139.9.52.158",
		// 广州BGP行情十二
		"139.9.90.169",
		// 上海BGP行情十
		"114.28.173.135",
		// 南京电信行情十二
		"103.221.142.73",
		// 上海BGP行情六
		"103.251.85.200",
		// 上海BGP行情七
		"103.251.85.201",
		// 南京电信行情一
		"103.221.142.65",
		// 南京电信行情二
		"103.221.142.66",
		// 南京电信行情三
		"103.221.142.67",
		// 南京电信行情四
		"103.221.142.68",
		// 南京电信行情五
		"103.221.142.69",
		// 南京电信行情六
		"103.221.142.70",
		// 南京电信行情七
		"103.221.142.71",
		// 南京电信行情八
		"103.221.142.72",
		// 西安电信行情一
		"117.34.114.13",
		// 西安电信行情二
		"117.34.114.14",
		// 西安电信行情三
		"117.34.114.15",
		// 西安电信行情四
		"117.34.114.16",
		// 西安电信行情五
		"117.34.114.17",
		// 西安电信行情六
		"117.34.114.18",
		// 西安电信行情七
		"117.34.114.20",
		// 西安电信行情八
		"117.34.114.27",
		// 深圳行情三
		"109.244.73.85",
		// XC行情一
		"118.126.53.193",
		// XC行情二
		"118.126.53.194",
		// 境外行情一
		"166.117.4.28",
		// 境外行情二
		"166.117.235.178",
	}
)

// SortHosts 通过tcp(ping不可用)连接速度的方式筛选排序可用的地址
func SortHosts(timeout ...time.Duration) []string {

	//超时时间
	_timeout := conv.Default(time.Second, timeout...)

	//至少需要一个
	chMustOne := safe.NewCloser()

	mu := sync.Mutex{}
	ls := []string(nil)
	for _, host := range Hosts {
		go func(host string) {
			addr := host
			if !strings.Contains(addr, ":") {
				addr += ":7709"
			}

			now := time.Now()
			c, err := net.Dial("tcp", addr)
			if err != nil {
				logs.Err(err)
				return
			}
			c.Close()

			logs.Debugf("Host: %-15s  Speed: %s\n", host, time.Since(now))
			mu.Lock()
			ls = append(ls, host)
			mu.Unlock()
			chMustOne.Close()
		}(host)
	}

	<-time.After(_timeout)
	<-chMustOne.Done()

	Hosts = ls

	return ls
}
